# STLExportOptions Methods (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
STLExportOptions Methods
STLExportOptions Class See Also
---
The STLExportOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from ATFBaseExportOptions.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsGridAspectRatioSet | Checks whether the GridAspectRatio tessellation parameter is explicitly set. |
| IsMaxEdgeLengthSet | Checks whether the MaxEdgeLength tessellation parameter is explicitly set. |
| IsNormalToleranceSet | Checks whether the NormalTolerance tessellation parameter is explicitly set. |
| IsSurfaceToleranceSet | Checks whether the SurfaceTolerance tessellation parameter is explicitly set. |
| IsValidForGridAspectRatio | Checks whether the value is allowed (is in the allowed range) for GridAspectRatio tessellation parameter. |
| IsValidForMaxEdgeLength | Checks whether the value is allowed (is in the allowed range) for MaxEdgeLength tessellation parameter. |
| IsValidForNormalTolerance | Checks whether the value is allowed (is in the allowed range) for NormalTolerance tessellation parameter. |
| IsValidForSurfaceTolerance | Checks whether the value is allowed (is in the allowed range) for SurfaceTolerance tessellation parameter. |
| SetTessellationSettings | Sets all the tessellation parameters to its predefined values for the given resolution type. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
STLExportOptions Class
Autodesk.Revit.DB Namespace